## 数据库加载

In [1]:
%load_ext sql

In [2]:
import pymysql 
pymysql.install_as_MySQLdb()
%sql mysql://stu2000013727:stu2000013727@162.105.146.37:43306

In [3]:
%sql use stu2000013727;

 * mysql://stu2000013727:***@162.105.146.37:43306
0 rows affected.

[]

## 查看所有表

In [4]:
%sql select* from account

 * mysql://stu2000013727:***@162.105.146.37:43306
9 rows affected.

[(9, None, '1111', 'ee79976c9380d5e337fc1c095ece8c8f22f91f306ceeb161fa51fecede2c4ba1'),
 (10, None, 'test233', 'ef797c8118f02dfb649607dd5d3f8c7623048c9c063d532cc95c5ed7a898a64f'),
 (11, None, 'testtest', '37268335dd6931045bdcdf92623ff819a64244b53d0e746d438797349d4da578'),
 (12, None, '11111111', 'ee79976c9380d5e337fc1c095ece8c8f22f91f306ceeb161fa51fecede2c4ba1'),
 (13, None, '1111111', 'ee79976c9380d5e337fc1c095ece8c8f22f91f306ceeb161fa51fecede2c4ba1'),
 (14, None, '111111', 'ee79976c9380d5e337fc1c095ece8c8f22f91f306ceeb161fa51fecede2c4ba1'),
 (15, None, '23333333', '8faafae81de147aceaceacfb27a5705fe9d451929a1fb10a7cba81f58613a181'),
 (16, None, '233333333', '9923d2ef2f40927f31f9e4560bd0a73e81d19eee6ccbf92a8dd0cf4f8bf5db34'),
 (17, None, 'testEmptyDate', '73dc486d710ed8dbe50e2adfc4f5e6b0715780677024429aca1a96a82f00ac16')]

In [18]:
%sql select * from bill

 * mysql://stu2000013727:***@162.105.146.37:43306
0 rows affected.

[]

In [6]:
%sql select * from diary

 * mysql://stu2000013727:***@162.105.146.37:43306
0 rows affected.

[]

In [7]:
%sql select * from friend

 * mysql://stu2000013727:***@162.105.146.37:43306
8 rows affected.

[(10, 10, ''),
 (11, 11, ''),
 (12, 12, ''),
 (13, 13, ''),
 (14, 14, ''),
 (15, 15, ''),
 (16, 16, ''),
 (17, 17, '')]

In [8]:
%sql select * from message

 * mysql://stu2000013727:***@162.105.146.37:43306
0 rows affected.

[]

In [9]:
%sql select * from qq_user

 * mysql://stu2000013727:***@162.105.146.37:43306
4 rows affected.

[(None, '111111', None, None, None, '111111', None, 14),
 (None, '23333333', None, None, None, '23333333', None, 15),
 (None, '233333333', 'ald', '12414124', None, '233333333', datetime.date(2000, 1, 1), 16),
 (None, 'testEmptyDate', '哈哈', None, None, 'testEmptyDate', None, 17)]

In [10]:
%sql select * from todolist

 * mysql://stu2000013727:***@162.105.146.37:43306
0 rows affected.

[]

## 建表（不要运行下面的块）

In [11]:
# %%sql

# show tables;
# delete from bill;
# delete from diary;
# delete from friend;
# delete from message;
# delete from qq_user;
# delete from todolist;
# delete from account;

In [12]:
%%sql

set @@foreign_key_checks=0;

drop table if exists account;
CREATE TABLE `account` (
  `id` int NOT NULL AUTO_INCREMENT COMMENT 'Primary Key',
  `create_time` datetime DEFAULT NULL COMMENT 'Create Time',
  `email` varchar(255) NOT NULL,
  `password` varchar(200) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='account table'; 
set @@foreign_key_checks=1;

 * mysql://stu2000013727:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [13]:
%%sql

drop table if exists bill;
CREATE TABLE `bill` (
  `id` int NOT NULL AUTO_INCREMENT COMMENT 'Primary Key',
  `create_time` datetime DEFAULT NULL COMMENT 'Create Time',
  `usr_name` varchar(255) DEFAULT NULL,
  `date_t` datetime DEFAULT NULL,
  `amount` float DEFAULT NULL,
  `inOrOut` enum('IN','OUT') DEFAULT NULL,
  `go_where` varchar(100) DEFAULT NULL,
  `category` enum('STUDY','ENTERTAINMENT','FOOD','HEALTHCARE','SALARY','OTHER') DEFAULT NULL,
  `comment` varchar(100) DEFAULT NULL,
  `account_id` int NOT NULL,
  PRIMARY KEY (`id`),
  KEY `fk_account` (`account_id`),
  CONSTRAINT `fk_account` FOREIGN KEY (`account_id`) REFERENCES `account` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='bill table';

 * mysql://stu2000013727:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]

In [14]:
%%sql

set @@foreign_key_checks=0;
drop table if exists qq_user;

CREATE TABLE `qq_user` (
  `create_time` datetime DEFAULT NULL COMMENT 'Create Time',
  `usr_name` varchar(255) DEFAULT NULL,
  `descriptor` varchar(500) DEFAULT NULL,
  `phone_num` varchar(20) DEFAULT NULL,
  `email` varchar(50) DEFAULT NULL,
  `account_number` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '账号, 类似于qq号',
  `birthday` date DEFAULT NULL,
  `account_id` int NOT NULL,
  PRIMARY KEY (`account_id`),
  /*UNIQUE KEY `unique_accountnumber` (`account_number`),*/
  CONSTRAINT `fk_account4` FOREIGN KEY (`account_id`) REFERENCES `account` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='QQ user table';
set @@foreign_key_checks=1;

 * mysql://stu2000013727:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [19]:
%%sql

set @@foreign_key_checks=0;
drop table if exists friend;
CREATE TABLE `friend` (
  `account_id` int DEFAULT NULL,
  `date_t` datetime DEFAULT NULL,
  `friend_id` int DEFAULT NULL,
  `friend_nickname` varchar(50) DEFAULT NULL,
  KEY `usr_id` (`account_id`),
  KEY `friend_id` (`friend_id`),
  CONSTRAINT `friend_ibfk_1` FOREIGN KEY (`account_id`) REFERENCES `account` (`id`),
  CONSTRAINT `friend_ibfk_2` FOREIGN KEY (`friend_id`) REFERENCES `account` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
set @@foreign_key_checks=1;

 * mysql://stu2000013727:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [15]:
%%sql


CREATE TABLE `diary` (
  `id` int NOT NULL AUTO_INCREMENT COMMENT 'Primary Key',
  `create_time` datetime DEFAULT NULL COMMENT 'Create Time',
  `writer_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `date_t` datetime DEFAULT NULL,
  `content` varchar(2048) DEFAULT NULL,
  `account_id` int NOT NULL,
  PRIMARY KEY (`id`),
  KEY `fk_account2` (`account_id`),
  CONSTRAINT `fk_account2` FOREIGN KEY (`account_id`) REFERENCES `account` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='diary table';





CREATE TABLE `message` (
  `id` int NOT NULL AUTO_INCREMENT COMMENT 'Primary Key',
  `sender_id` int DEFAULT NULL,
  `receiver_id` int DEFAULT NULL,
  `date_t` datetime DEFAULT NULL,
  `content` varchar(1000) DEFAULT NULL,
  `read_t` tinyint(1) DEFAULT '0' COMMENT '消息是否已读',
  `account_id` int NOT NULL,
  PRIMARY KEY (`id`),
  KEY `fk_account3` (`account_id`),
  KEY `fk_1` (`sender_id`),
  KEY `fk_2` (`receiver_id`),
  CONSTRAINT `fk_1` FOREIGN KEY (`sender_id`) REFERENCES `qq_user` (`account_id`),
  CONSTRAINT `fk_2` FOREIGN KEY (`receiver_id`) REFERENCES `qq_user` (`account_id`),
  CONSTRAINT `fk_account3` FOREIGN KEY (`account_id`) REFERENCES `account` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='message table';

CREATE TABLE `todolist` (
  `create_time` datetime DEFAULT NULL COMMENT 'Create Time',
  `usr_name` varchar(255) DEFAULT NULL,
  `entry_name` varchar(50) NOT NULL,
  `content` varchar(100) DEFAULT NULL,
  `ddl` datetime DEFAULT NULL,
  `alarm` enum('yes','no') DEFAULT NULL,
  `complete` tinyint(1) DEFAULT '0',
  `account_id` int NOT NULL,
  PRIMARY KEY (`entry_name`),
  KEY `fk_account5` (`account_id`),
  CONSTRAINT `fk_account5` FOREIGN KEY (`account_id`) REFERENCES `account` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='toDoList table';

 * mysql://stu2000013727:***@162.105.146.37:43306
(pymysql.err.OperationalError) (1050, "Table 'diary' already exists")
[SQL: CREATE TABLE `diary` (
  `id` int NOT NULL AUTO_INCREMENT COMMENT 'Primary Key',
  `create_time` datetime DEFAULT NULL COMMENT 'Create Time',
  `writer_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `date_t` datetime DEFAULT NULL,
  `content` varchar(2048) DEFAULT NULL,
  `account_id` int NOT NULL,
  PRIMARY KEY (`id`),
  KEY `fk_account2` (`account_id`),
  CONSTRAINT `fk_account2` FOREIGN KEY (`account_id`) REFERENCES `account` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='diary table';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [5]:
%%sql 

drop table if exists new_friend;
CREATE TABLE new_friend(  
    id int NOT NULL PRIMARY KEY AUTO_INCREMENT COMMENT 'Primary Key',
    date_t DATETIME COMMENT 'Create Time',
    sender_id INT NOT NULL,
    receiver_id INT NOT NULL,
    FOREIGN KEY(sender_id) REFERENCES account(id),
    FOREIGN KEY(receiver_id) REFERENCES account(id)
) COMMENT '';

 * mysql://stu2000013727:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]

In [6]:
%sql show tables

 * mysql://stu2000013727:***@162.105.146.37:43306
8 rows affected.

[('account',),
 ('bill',),
 ('diary',),
 ('friend',),
 ('message',),
 ('new_friend',),
 ('qq_user',),
 ('todolist',)]

## 清空表

In [4]:
%%sql

set @@foreign_key_checks=0;

truncate table account;
truncate table bill;
truncate table diary;
truncate table friend;
truncate table message;
truncate table new_friend;
truncate table qq_user;
truncate table todolist;

set @@foreign_key_checks=1;

 * mysql://stu2000013727:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]